
#ifndef __EVENTS_H
#define __EVENTS_H

#include "cmsis_os2.h"

//*************************************************************************************************
// ID объектов RTOS с общим доступом
//*************************************************************************************************
extern osEventFlagsId_t uart_event, chk_event, cmnd_event;

//*************************************************************************************************
// Флаги событий при обмене данными по UART
//*************************************************************************************************
#define EVN_UART_RECV               0x00000001  //принята строка команды
#define EVN_UART_START              0x00000002  //запуск ожидания приема данных 
                                                //после завершения выполнения команды
#define EVN_UART_NEXT               0x00000004  //передача следующего блока 

#define EVN_UART_MASK               ( EVN_UART_RECV | EVN_UART_START | EVN_UART_NEXT )

//*************************************************************************************************
// Флаги событий выполнения команд
//*************************************************************************************************
#define EVN_CMND_EXEC               0x00000001  //выполнение команды
#define EVN_CMND_PROMPT             0x00000002  //вывод символа ">" в консоль

#define EVN_CMND_MASK               ( EVN_CMND_EXEC | EVN_CMND_PROMPT )

//*************************************************************************************************
// Флаги событий управления индикацией состояния электроприводов
//*************************************************************************************************
#define EVN_LED_ZB_ACTIVE           0x00010000  //включение индикации "обмен пакетами по ZigBee"

#define EVN_LED_MASK                ( EVN_LED_ZB_ACTIVE )


//*************************************************************************************************
// Флаги событий управления обменом с ZigBee модулем 
//*************************************************************************************************
#define EVN_ZB_CONFIG               0x00000001  //проверка настроек модуля ZigBee

#define EVN_ZC_RECV_CHECK           0x00000010  //прием пакета завершен
#define EVN_ZC_SEND_WLOG            0x00000020  //вывод журнальных данных

#define EVN_ZC_MASK                 ( EVN_ZC_RECV_CHECK | EVN_ZC_SEND_WLOG )


#define EVN_ZB_RECV_CHECK           0x00000100  //прием пакета завершен
#define EVN_ZB_SEND_WLOG            0x00000200  //вывод журнальных данных

#define EVN_ZB_MASK                 ( EVN_ZB_RECV_CHECK | EVN_ZB_SEND_WLOG )

#endif
